#Создать список и заполнить его элементами различных типов данных.
#Реализовать скрипт проверки типа данных каждого элемента.
#Использовать функцию type() для проверки типа.
#Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
#
for i in [7, 'строка', tuple(), set(), dict(), bool(), bytes(), bytearray(), None]:
    print(i, type((i)));
